import streamlit as st
import pandas as pd

data = pd.DataFrame({
    '월': [
        '1월',
        '2월',
        '3월',
        '4월',
        '5월',
        '6월',
    ],
    '매출': [
        12_500_000,
        14_200_000,
        13_800_000,
        16_400_000,
        18_100_000,
        19_700_000,
    ]
})


st.title('월별 매출')
st.line_chart(
    data=data,
    x='월',
    y='매출',
    x_label='기간',
    y_label='매출액'
)

regional_data = pd.DataFrame({
    '월': [
        '1월',
        '2월',
        '3월',
        '4월',
        '5월',
        '6월',
    ],
    '부산': [
        12_500_000,
        14_200_000,
        13_800_000,
        16_400_000,
        18_100_000,
        19_700_000,
    ],
    '대전': [
        10_500_000,
        11_200_000,
        10_800_000,
        11_400_000,
        10_100_000,
        11_700_000,
    ]
})

st.title('지역별 월 매출')
